Catalogs/стомВидыЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВидыЗубов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШиринаКанвы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаКанвы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВариантов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обозначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>удалитьОбозначенияЗуба</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновнойВариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обозначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/стомВидыОбластей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>стомВидыОбластей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбластьЗуба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементКонструкции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/стомВариантыЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВариантыЗубов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструкция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокОбластей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомСегментыЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомСегментыЗубов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.стомВидыЗубов</xr:Item>
				<xr:Item>Catalog.стомВидыЗубныхКарт</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомВидыЗубныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВидыЗубныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШиринаКанвы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаКанвы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Зуб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВидыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TranslateX</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TranslateY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Rotation</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ScaleX</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ScaleY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ZIndex</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойВариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтроковоеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обозначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗубВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокВариантов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубныхКарт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтроковоеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокВариантовЗубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокОбщихСегментов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СегментВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомСегментыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаВариантовОбластей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубныхКарт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗубВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомВидыЗубов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//#Область ПЕРЕМЕННЫЕ

&НаКлиенте
Перем ТекВариантЗуба;  //хранит предыдущий выбранный вариант зуба до редактирования

&НаКлиенте
Перем ТекСегментЗуба; //хранит предыдущий выбранный сегмент зуба до редактирования

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗубнаяКарта = стомСтоматология.ПолучитьЗубнуюКарту();
	
	ЗагрузитьСписокВариантов();
	ЗаполнитьСписокСегментов();
	ЗаполнитьСписокОбщихСегментов();
	
	HTML = ПараметрыСеанса.стомКешированныеДанныеЗК.ПриложениеHTML;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	
	Объект.СписокВариантов.Очистить();
	Для Каждого СтрокаВариант Из СписокВариантов Цикл
		Если СтрокаВариант.Установлен Тогда 
			НоваяСтрока = Объект.СписокВариантов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВариант);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьСегментыЗуба();
	ЗаполнитьСписокСегментов();
	ЗаполнитьСписокОбщихСегментов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	
	ИнициализироватьЗубВПриложении();
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	стомКомпонентыКлиент.ОбработатьСобытиеПриложения(ЭтаФорма, Элемент, ДанныеСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗубнаяКартаПриИзменении(Элемент)
	
	ЗаполнитьСписокОбщихСегментов();
	ИнициализироватьЗубВПриложении();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВариантовПриАктивизацииСтроки(Элемент)
	
	ИнициализироватьЗубВПриложении();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСегментовПриИзменении(Элемент)
	
	ИнициализироватьЗубВПриложении();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСегментовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанныеСегмент = Элемент.ТекущиеДанные;
	Если ТекДанныеСегмент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекДанныеСегмент.Идентификатор = Строка(Новый УникальныйИдентификатор);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСегментовСегментПриИзменении(Элемент)
	
	ТекДанныеСегмент = Элементы.СписокСегментов.ТекущиеДанные;
	Если ТекДанныеСегмент = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыСегмента = ПолучитьПараметрыСегмента(ТекДанныеСегмент.Сегмент);	
	ЗаполнитьЗначенияСвойств(ТекДанныеСегмент, ПараметрыСегмента);
	ТекДанныеСегмент.ПараметрыСегмента = ПараметрыСегмента;
	
	ИнициализироватьЗубВПриложении();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСегментовПриАктивизацииСтроки(Элемент)
	
	стомКомпонентыКлиент.ОбновитьПриложениеЗубнойКарты(Элементы.HTML, ПолучитьСтруктуруВыделенныхСегментов());
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафическиеПараметрыПриИзменении(Элемент)
	
	ОбновитьЗубВПриложении();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьЗубВПриложении()
	
	ВариантыЗубов = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокВариантов.ВыделенныеСтроки Цикл
		ВариантыЗубов.Добавить(Элементы.СписокВариантов.ДанныеСтроки(ВыделеннаяСтрока).ВариантЗуба);
	КонецЦикла;
	
	стомКомпонентыКлиент.ЗагрузитьЗубнуюКартуВПриложении(Элементы.HTML, ПолучитьСтруктуруИнициализации(ВариантыЗубов));
	стомКомпонентыКлиент.ОбновитьПриложениеЗубнойКарты(Элементы.HTML, ПолучитьСтруктуруВыделенныхСегментов());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗубВПриложении()
	
	стомКомпонентыКлиент.ОбновитьПриложениеЗубнойКарты(Элементы.HTML, ПолучитьСтруктуруОбновления());
	стомКомпонентыКлиент.ОбновитьПриложениеЗубнойКарты(Элементы.HTML, ПолучитьСтруктуруВыделенныхСегментов());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыПриложения(Элемент, ВыделенныеЗубыСегменты) Экспорт 
	
	Элементы.СписокСегментов.ВыделенныеСтроки.Очистить();
	
	ВыделенныеСегменты = ВыделенныеЗубыСегменты.Получить("_");
	Если ВыделенныеСегменты = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого кзВыделенныйСегмент Из ВыделенныеСегменты Цикл
		СтрокиСегмент = СписокСегментов.НайтиСтроки(Новый Структура("Идентификатор", кзВыделенныйСегмент.Ключ));
		Для Каждого СтрокаСегмент Из СтрокиСегмент Цикл
			Элементы.СписокСегментов.ВыделенныеСтроки.Добавить(СтрокаСегмент.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруИнициализации(ВариантыЗубов)
	
	ОбластиВарианта = ПолучитьОбластиВарианта(ВариантыЗубов);
	
	СтруктураJSON = Новый Структура("width, height, elements, selectWithCTRL", 500, 500, Новый Массив, Ложь);
	
	// Зуб
	ПараметрыРасположения = Новый Структура("x, y, sX, sY, r", 
			Объект.TranslateX, Объект.TranslateY, Объект.ScaleX, Объект.ScaleY, Объект.Rotation);
	СтруктураЗубJSON = Новый Структура("operation, id, width, height, transform, elements", 
			"+", "_", Объект.ШиринаКанвы, Объект.ВысотаКанвы, ПараметрыРасположения, Новый Массив);
	СтруктураJSON.elements.Добавить(СтруктураЗубJSON);
	
	МаксИндексОбщихСегментов = 0;
	Для Каждого СтрокаСегмент Из СписокСегментов.НайтиСтроки(Новый Структура("Общий", Истина)) Цикл
		МаксИндексОбщихСегментов = Макс(МаксИндексОбщихСегментов, СписокСегментов.Индекс(СтрокаСегмент));
	КонецЦикла;
	
	// Сегменты
	Для Каждого СтрокаСегмент Из СписокСегментов Цикл
		
		Если ОбластиВарианта.Найти(СтрокаСегмент.Область) = Неопределено Или Не ЗначениеЗаполнено(СтрокаСегмент.Сегмент) Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексСтроки = МаксИндексОбщихСегментов + СписокСегментов.Индекс(СтрокаСегмент);
		ПараметрыРасположения = Новый Структура("x, y, sX, sY, r, z", 
			СтрокаСегмент.TranslateX, СтрокаСегмент.TranslateY, СтрокаСегмент.ScaleX, СтрокаСегмент.ScaleY, СтрокаСегмент.Rotation, ИндексСтроки);
		СтруктураФигура = Новый Структура("silverlight, fill", СтрокаСегмент.ПараметрыСегмента.Фигура, "#" + НРег(Прав(СтрокаСегмент.ПараметрыСегмента.ЦветHex, 6)));
		СтруктураСегментJSON = Новый Структура("operation, id, transform, shape, isDecoration", 
			"+", СтрокаСегмент.Идентификатор, ПараметрыРасположения, СтруктураФигура, СтрокаСегмент.ПараметрыСегмента.Декоративный);
		СтруктураЗубJSON.elements.Добавить(СтруктураСегментJSON);
		
	КонецЦикла;
			
	Возврат СтруктураJSON;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруОбновления()
	
	СтруктураJSON = Новый Структура("elements", Новый Массив);
	
	ПараметрыРасположения = Новый Структура("x, y, sX, sY, r", 
			Объект.TranslateX, Объект.TranslateY, Объект.ScaleX, Объект.ScaleY, Объект.Rotation);
	СтруктураЗубJSON = Новый Структура("operation, id, width, height, transform", 
			"", "_", Объект.ШиринаКанвы, Объект.ВысотаКанвы, ПараметрыРасположения);
	СтруктураJSON.elements.Добавить(СтруктураЗубJSON);
	
	Возврат СтруктураJSON;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруВыделенныхСегментов()
	
	ВыделенныеЗубы = Новый Соответствие;
	ВыделенныеСегменты = Новый Соответствие;
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокСегментов.ВыделенныеСтроки Цикл 
		ВыделенныеСегменты.Вставить(Элементы.СписокСегментов.ДанныеСтроки(ВыделеннаяСтрока).Идентификатор);	
	КонецЦикла;
	ВыделенныеЗубы.Вставить("_", ВыделенныеСегменты);
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("selectedElements", ВыделенныеЗубы);
	
	Возврат СтруктураJSON;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбластиВарианта(ВариантыЗубов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВариантыЗубов", ВариантыЗубов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	стомВариантыЗубовСписокОбластей.Область КАК Область
	|ИЗ
	|	Справочник.стомВариантыЗубов.СписокОбластей КАК стомВариантыЗубовСписокОбластей
	|ГДЕ
	|	стомВариантыЗубовСписокОбластей.Ссылка В(&ВариантыЗубов)";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Область");
	
КонецФункции

&НаСервере
Процедура ЗагрузитьСписокВариантов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаВариантов", Объект.СписокВариантов.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВариантов.ВариантЗуба КАК ВариантЗуба,
	|	ТаблицаВариантов.Обозначение КАК Обозначение
	|ПОМЕСТИТЬ ВариантыЗуба
	|ИЗ
	|	&ТаблицаВариантов КАК ТаблицаВариантов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомВариантыЗубов.Ссылка КАК ВариантЗуба,
	|	ВЫБОР
	|		КОГДА стомВариантыЗубов.Основной
	|				И НЕ ВариантыЗуба.ВариантЗуба ЕСТЬ NULL
	|			ТОГДА ВариантыЗуба.Обозначение
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Обозначение,
	|	НЕ ВариантыЗуба.ВариантЗуба ЕСТЬ NULL КАК Установлен,
	|	стомВариантыЗубов.Основной КАК Основной
	|ИЗ
	|	Справочник.стомВариантыЗубов КАК стомВариантыЗубов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВариантыЗуба КАК ВариантыЗуба
	|		ПО стомВариантыЗубов.Ссылка = ВариантыЗуба.ВариантЗуба
	|ГДЕ
	|	НЕ стомВариантыЗубов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Установлен УБЫВ,
	|	Основной УБЫВ";
	Результат = Запрос.Выполнить();
	СписокВариантов.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСегментов()
	
	СписокСегментов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	стомСегментыЗубов.Ссылка КАК СегментВЗубе,
	|	стомСегментыЗубов.TranslateX КАК TranslateX,
	|	стомСегментыЗубов.TranslateY КАК TranslateY,
	|	стомСегментыЗубов.ScaleX КАК ScaleX,
	|	стомСегментыЗубов.ScaleY КАК ScaleY,
	|	стомСегментыЗубов.Rotation КАК Rotation,
	|	стомСегментыЗубов.ZIndex КАК ZIndex,
	|	стомСегментыЗубов.Наименование КАК Наименование,
	|	стомСегментыЗубов.Сегмент КАК Сегмент,
	|	стомСегментыЗубов.Сегмент.Область КАК Область
	|ИЗ
	|	Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|ГДЕ
	| 	НЕ стомСегментыЗубов.ПометкаУдаления
	|	И стомСегментыЗубов.Владелец ССЫЛКА Справочник.стомВидыЗубов
	|	И стомСегментыЗубов.Владелец = &Зуб
	|
	|УПОРЯДОЧИТЬ ПО
	|	стомСегментыЗубов.ZIndex";
	Запрос.УстановитьПараметр("Зуб", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокСегментов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Идентификатор = Строка(Выборка.СегментВЗубе.УникальныйИдентификатор());
		НоваяСтрока.СегментВЗубе = Выборка.СегментВЗубе;
		НоваяСтрока.ПараметрыСегмента = ПолучитьПараметрыСегмента(Выборка.Сегмент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбщихСегментов()
	
	Для Каждого СтрокаСегмент Из СписокСегментов.НайтиСтроки(Новый Структура("Общий", Истина)) Цикл
		СписокСегментов.Удалить(СтрокаСегмент);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	стомСегментыЗубов.Ссылка КАК СегментВЗубе,
	|	стомСегментыЗубов.TranslateX КАК TranslateX,
	|	стомСегментыЗубов.TranslateY КАК TranslateY,
	|	стомСегментыЗубов.ScaleX КАК ScaleX,
	|	стомСегментыЗубов.ScaleY КАК ScaleY,
	|	стомСегментыЗубов.Rotation КАК Rotation,
	|	стомСегментыЗубов.ZIndex КАК ZIndex,
	|	стомСегментыЗубов.Наименование КАК Наименование,
	|	стомСегментыЗубов.Сегмент КАК Сегмент,
	|	стомСегментыЗубов.Сегмент.Область КАК Область
	|ИЗ
	|	Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|ГДЕ
	|	стомСегментыЗубов.Владелец ССЫЛКА Справочник.стомВидыЗубныхКарт
	|	И стомСегментыЗубов.Владелец = &ЗубнаяКарта
	|	И стомСегментыЗубов.Сегмент.Область.ВидОбласти = ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.ОбластьЗуба)
	|
	|УПОРЯДОЧИТЬ ПО
	|	стомСегментыЗубов.ZIndex";
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокСегментов.Вставить(0);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Общий = Истина;
		НоваяСтрока.Идентификатор = Строка(Выборка.СегментВЗубе.УникальныйИдентификатор());
		НоваяСтрока.СегментВЗубе = Выборка.СегментВЗубе;
		НоваяСтрока.ПараметрыСегмента = ПолучитьПараметрыСегмента(Выборка.Сегмент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыСегмента(Сегмент)
	
	РеквизитыСегмента = "TranslateX, TranslateY, ScaleX, ScaleY, Rotation, Область, Фигура, ЦветHex, Декоративный";
	ПараметрыСегмента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сегмент, РеквизитыСегмента);
	Возврат ПараметрыСегмента;
	
КонецФункции

&НаСервере
Процедура ОбновитьСегментыЗуба()
	
	СегментыВЗубе = Новый Массив;
	
	Для Каждого СтрокаСегмент Из СписокСегментов Цикл
		
		Если СтрокаСегмент.Общий Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСегмент.СегментВЗубе) Тогда
			СегментВЗубеОбъект = СтрокаСегмент.СегментВЗубе.ПолучитьОбъект();
		Иначе
			СегментВЗубеОбъект = Справочники.стомСегментыЗубов.СоздатьЭлемент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СегментВЗубеОбъект, СтрокаСегмент);
		СегментВЗубеОбъект.Владелец = Объект.Ссылка;
		СегментВЗубеОбъект.ZIndex = СписокСегментов.Индекс(СтрокаСегмент);
		СегментВЗубеОбъект.Записать();
		
		СегментыВЗубе.Добавить(СтрокаСегмент.СегментВЗубе);
		
	КонецЦикла;
	
	Ссылки = Новый Массив(1);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомСегментыЗубов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|ГДЕ
	|	стомСегментыЗубов.Владелец ССЫЛКА Справочник.стомВидыЗубов
	|	И стомСегментыЗубов.Владелец = &Зуб
	|	И НЕ стомСегментыЗубов.Ссылка В (&СегментыВЗубе)
	|	И НЕ стомСегментыЗубов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Зуб", Объект.Ссылка);
	Запрос.УстановитьПараметр("СегментыВЗубе", СегментыВЗубе);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		Ссылки[0] = Выборка.Ссылка;
		Если НайтиПоСсылкам(Ссылки) = Неопределено Тогда 
			Выборка.Ссылка.ПолучитьОбъект().Удалить();
		Иначе
			Выборка.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
